OpenFOAM-5.x/tutorials/compressible/rhoPimpleDyMFoam/annularThermalMixer/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatureExtract

runApplication blockMesh
runApplication snappyHexMesh -overwrite

if [ -d 0 ] ; then
   rm -rf 0
fi

runApplication createBaffles -overwrite
runApplication mergeOrSplitBaffles -split -overwrite

cp -r 0.orig 0

runApplication $(getApplication)

#------------------------------------------------------------------------------
